Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: In particular, negating a signed, fixed-width integer type’s minimum results in a value that cannot be represented.
ja: とりわけ、符号付きの、固定長整数型のもつ最小値を負にすることは、表現できない値という結果になります。

source: In particular, pointers and class instances all have the same contiguous memory footprint, regardless of the size of the referenced data.
ja: 特に、ポインタおよびクラスインスタンスは、すべて同じ隣接メモリフットプリントを持ちます、参照されたデータの大きさに関係なく。

source: In particular, the names "Alicia", "Chris", and "Diana" are removed.
ja: 個別的には、名前"Alicia"、"Chris"、そして"Diana"は、削除されます。

source: In particular, the names "Bethany" and "Eric" are removed from employees.
ja: 個別的には、"Bethany"と"Eric"がemployeesから削除されます。

source: In particular, the names "Alicia", "Chris", and "Diana" are removed from employees while the names "Forlani" and "Greta" are added.
ja: 個別的には、名前"Alicia"、"Chris"、そして"Diana"は、employeesから削除される一方で名前"Forlani"と"Greta"は加えられます。

source: In particular, the names "Bethany" and "Eric" are removed from employees while the name "Forlani" is added.
ja: 個別的には、名前"Bethany"と"Eric"はemployeesから削除される一方、名前"Forlani"は加えられます。

source: In particular, the names "Bethany" and "Eric" do not appear in eitherNeighborsOrEmployees.
ja: 個別的には、名前"Bethany"と"Eric"は、eitherNeighborsOrEmployeesの中に現れません。

source: In particular, to find the value matching a key, you must search through every element of the collection.
ja: 特に、あるキーに合った値を見つけるには、あなたはコレクションのすべての要素を通して検索しなければなりません。

source: In some cases, oldMember may be distinguishable from newMember by identity comparison or some other means.
ja: いくつかの場合には、oldMemberは同一性比較または何らかの他の意味でnewMemberから区別可能であるかもしれません。

source: In some cases, a returned element may be distinguishable from member by identity comparison or some other means.
ja: いくつかの場合には、ある返される要素は、同一性比較または何らかの他の意味でmemberから区別可能であるかもしれません。

source: In some cases, the returned element may be distinguishable from newMember by identity comparison or some other means.
ja: いくつかの場合には、返される要素は、同一性比較または何らかの他の意味でnewMemberから区別可能であるかもしれません。

source: In synchronous APIs, the result of calling the closure will be available immediately after you pass the closure.
ja: 同期APIでは、クロージャ呼び出しの結果は、あなたがクロージャを渡した直後に利用可能になります。

source: In that case, the method returns nil.
ja: その場合には、このメソッドはnilを返します。

source: In the case of the Directions option set, an instance can contain zero, one, or more of the four defined directions.
ja: Directionsオプションセットの場合では、あるインスタンスは４つ定義された方向のうちゼロ、１つ、またはそれ以上を含むことができます。

source: In the example above, moreNumbers has the same type as numbers, which is [Int].
ja: 上の例において、moreNumbersはnumbersと同じ型を持ちます、それは[Int]です。

source: In the example, because the express static property is assigned an array literal with the nextDay and secondDay options, it will contain those two elements.
ja: 例において、express静的プロパティはnextDayとsecondDayオプションを持つ配列リテラルを割り当てられるので、それはそれら２つの要素を含みます。

source: In the following example, goodResult provides a successful result with the integer value 1.
ja: 以下の例において、goodResultは成功結果を整数値の1で提供します。

source: In the following example, a new element is inserted into classDays, a set of days of the week.
ja: 以下の例において、新しい要素が、一揃いの曜日classDaysへ挿入されます。

source: In the following example, an array of numbers is partitioned by a predicate that matches elements greater than 30.
ja: 次の例において、数からなる配列は、30より大きな要素に合致するという述部によって仕切られます。

source: In the following example, because the extension applies only to Sequence, side-effects such as the accumulation of result are never unexpectedly dropped or deferred:
ja: 以下の例において、拡張はSequenceに対してのみ適用されることから、副作用それら、たとえばresultの蓄積などは、決して不意に投下されたり延期されたりしません。

source: In the following example, the .priority shipping option is removed from the options option set.
ja: 以下の例において、.priority出荷オプションは、optionsオプションセットから削除されます。

source: In the following example, the .secondDay shipping option is added to the freeOptions option set if purchasePrice is greater than 50.0.
ja: 次の例において、.secondDay出荷オプションは、purchasePriceが50.0より大きいならば、freeOptionsオプションセットを加えられます。

source: In the following example, the asciiTable sequence is made by zipping together the characters in the alphabet string with a partial range starting at 65, the ASCII value of the capital letter A. Iterating over two zipped sequences continues only as long as the shorter of the two sequences, so the iteration stops at the end of alphabet.
ja: 以下の例において、asciiTableシーケンスは、alphabet文字列中の文字を65で始まるある部分範囲と一緒に閉じ合わせることによって作られます。２つの閉じ合わされたシーケンスそれらに反復することは、より短いほうと同じだけ続きます、それでこの反復はalphabetの終わりで停止します。

source: In the following example, the attendeesAndVisitors set is made up of the elements of the attendees and visitors sets:
ja: 以下の例において、attendeesAndVisitors集合はattendeesとvisitors集合の要素から作り上げられます：

source: In the following example, the attendeesAndVisitors set is made up of the elements of the attendees set and the visitors array:
ja: 以下の例において、attendeesAndVisitors集合はattendees集合とvisitors配列の要素から作り上げられます：

source: In the following example, the bothNeighborsAndEmployees set is made up of the elements that are in both the employees and neighbors sets.
ja: 次の例において、bothNeighborsAndEmployees集合はemployeesとneighbors集合の両方にある要素から作り上げられます。

source: In the following example, the eitherNeighborsOrEmployees set is made up of the elements of the employees and neighbors sets that are not in both employees and neighbors.
ja: 以下の例において、eitherNeighborsOrEmployees集合はemployeesとneighbors集合の要素で、employeesおよびneighborsの両方の中にはないものから作り上げられます：

source: In the following example, the employees set is disjoint with the visitors set because no name appears in both sets.
ja: 次の例において、employees集合はvisitors集合と交わりを持ちません、両方に現れる名前がないからです。

source: In the following example, the employees set is disjoint with the elements of the visitors array because no name appears in both.
ja: 次の例において、employees集合はvisitors配列の要素と交わりを持ちません、両方に現れる名前がないからです。

source: In the following example, the nonNeighbors set is made up of the elements of the employees set that are not elements of neighbors:
ja: 次の例において、nonNeighbors集合はemployees集合の要素でneighborsの要素でないものから作り上げられます：

source: In the following example, the numberToMatch constant is wrapped as an optional before comparing to the optional numberFromString:
ja: 続く例において、numberToMatch定数は、オプショナルnumberFromStringとの比較の前にオプショナル値としてラップされます：

source: In the following example, the closure provides an ordering for an array of a custom enumeration that describes an HTTP response.
ja: 以下の例では、そのクロージャは、あるHTTP応答を記述するあつらえ列挙の配列に対してある順序付けを提供します。

source: In the following example, the constant y is successfully created from x, an Int instance with a value of 100.
ja: 以下の例において、定数yは、Intインスタンスで100の値を持つxからうまく作成されます

source: In the following example, the constant x is successfully created from a value of 100, while the attempt to initialize the constant y from 1_000 fails because the Int8 type can represent 127 at maximum:
ja: 以下の例において、定数xは100の値から首尾よく作り上げられます、一方で定数yを1_000から初期化する試みは失敗します、なぜならInt8型は最大で127を表現可能だからです：

source: In the following example, the constant x is successfully created from a value of 21.0, while the attempt to initialize the constant y from 21.5 fails:
ja: 続く例において、定数xは21.0の値から首尾よく作成されます、一方で定数yを21.5から初期化する試みは失敗します：

source: In the following example, the difference of 10 and 21 is less than zero, the minimum representable UInt value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と21の差はゼロ、最小限表現可能なUInt値、よりも少ないです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the difference of 10 and 21 is less than zero, the minimum representable UInt value, so the result is the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と21の差はゼロ、最小限表現可能なUInt値、よりも少ないです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the elements of the employees set that are also elements of the neighbors array are removed.
ja: 次の例において、employees集合の要素でまたneighbors配列の要素でもあるものは削除されます。

source: In the following example, the elements of the employees set that are also members of neighbors are removed from employees, while the elements of neighbors that are not members of employees are added to employees.
ja: 以下の例において、employees集合の要素でまたneighborsのメンバであるものはemployeesから削除されます、一方でneighborsの要素でemployeesの要素でないものはemployeesに加えられます。

source: In the following example, the elements of the employees set that are also members of the neighbors set are removed.
ja: 次の例において、employees集合の要素でまたneighbors集合のメンバでもあるものは削除されます。

source: In the following example, the elements of the employees set that are not also members of the neighbors set are removed.
ja: 次の例において、employees集合の要素でまたneighbors集合のメンバではないものは削除されます。

source: In the following example, the elements of the visitors set are added to the attendees set:
ja: 次の例において、visitors集合の要素はattendees集合に加えられます。

source: In the following example, the predicate provides an ordering for an array of a custom HTTPResponse type.
ja: 以下の例では、その述部はあつらえのHTTPResponse型の配列に対してある順序付けを提供します。

source: In the following example, the product of 10 and 50 is greater than the maximum representable Int8 value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と50の積は、最大限表現可能なInt8値より大きいです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the publisher for an Int? optional publishes its value once, then finishes normally:
ja: 以下の例において、あるInt?オプショナルに対するパブリッシャーは、それの値を一度だけ出版します、それから正常に終了します：

source: In the following example, the result of 21 * 21 is greater than the maximum representable Int8 value:
ja: 以下の例において、21 * 21の結果は、最大限表現可能なInt8値より大きいです：

source: In the following example, the result of 21 + 120 is greater than the maximum representable Int8 value:
ja: 以下の例において、21 + 120の結果は、最大限表現可能なInt8値より大きいです：

source: In the following example, the result of 21 - 50 is less than zero, the minimum representable UInt8 value:
ja: 以下の例において、21 - 50の結果は、最大限表現可能なUInt8値より大きいです：

source: In the following example, the sum of 100 and 121 is greater than the maximum representable Int8 value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、100と121の合計は、最大限表現可能なInt8値より大きいです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the next example, badResult is a failure result that wraps a custom error.
ja: 次の例において、badResultはある不成功結果です、それはあるあつらえのエラーをラップするものです。

source: In the next example, an Int? optional that’s nil immediately sends the Subscribers.Completion.finished completion, without producing any values.
ja: 次の例において、あるInt?オプショナルでnilであるものは、直接にSubscribers.Completion.finished達成状態を送信します、何ら値を生み出すことなしに。

source: In the next example, an integer literal is compared with the optional integer numberFromString.
ja: 次の例では、整数リテラルがオプショナル整数numberFromStringと比較されます。

source: In the next example, the .express element is passed to remove(_:).
ja: 次の例では、.express要素がremove(_:)に渡されます。

source: In the standard library, you can use the Set type with elements of any hashable type, or you can easily create bit masks with SetAlgebra conformance using the OptionSet protocol.
ja: 標準ライブラリにおいて、あなたはSet型を何らかのハッシュ型の要素で使うことができます、またはあなたはSetAlgebra準拠を持つビットマスクをOptionSetプロトコルを使って簡単に作成することができます。

source: In these cases, you need to store the whole result rather than just the success value or that the API call failed.
ja: これらの場合において、あなたは全体の結果を取っておく必要があります、成功値またはAPI呼び出しが失敗したことだけでなく。

source: In these scenarios, use the NS_ENUM macro instead.
ja: それらの予想される事態には、NS_ENUMマクロを代わりに使ってください。

source: In this case, see the documentation of Collection.underestimatedCount.
ja: この場合には、Collection.underestimatedCountの文書を見てください。

source: In this case, you cannot assume either that a sequence will be consumable and will resume iteration, or that a sequence is a collection and will restart iteration from the first element.
ja: この場合、あるシーケンスが消耗可能になっているそして反復を再開することになるか、またはあるシーケンスがコレクションであるそして最初の要素から反復を再度着手することになるか、あなたはどちらか決めてかかることはできません。

source: In this example, filter(_:) is used to include only names shorter than five characters.
ja: この例において、filter(_:)は５つの文字より短い名前のみ含めるために使われます。

source: In this example, map is used first to convert the names in the array to lowercase strings and then to count their characters.
ja: この例では、mapは最初に配列中の名前を小文字文字列に変換するために、それからそれらの文字を数えるために使われます。

source: In this example, x is initialized as an Int8 instance by clamping 500 to the range -128...127, and y is initialized as a UInt instance by clamping -500 to the range 0...UInt.max.
ja: この例において、xはInt8インスタンスとして、500を範囲-128...127に制限すること（クランピング）によって初期化されます、そしてyはUIntインスタンスとして、-500を範囲0...UInt.maxに制限することによって初期化されます。

source: In this example, a new element is inserted into classDays, a set of days of the week.
ja: この例において、新しい要素が、一揃いの曜日classDaysへ挿入されます。

source: In this example, an Objective-C class that provides a convenience initializer that takes variadic arguments for key-value pairs suggests using a dictionary literal instead:
ja: この例において、可変長引数をキー値ペアに対して取る便宜イニシャライザを提供するあるObjective-Cクラスは、代わりに辞書リテラルを使うことを提案します：

source: In this example, an array of three ranges is flattened so that the elements of each range can be iterated in turn.
ja: この例において、３つの範囲からなる配列は平坦化されます、それで各範囲の要素は順に反復されることができます。

source: In this example, an existing element is inserted into classDays, a set of days of the week.
ja: この例において、既存の要素が、一揃いの曜日classDaysへ挿入されます。

source: In this example, note the difference in the result of using map and compactMap with a transformation that returns an optional Int value.
ja: この例において、mapとcompactMapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an array.
ja: この例において、mapとflatMapをある配列を返す変換とともに使うことの結果における違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an optional Int value.
ja: この例において、mapとflatMapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an result type.
ja: この例において、mapとflatMapをある結果型を返す変換とともに使うことの結果における違いに注意してください。

source: In this example, the assignment to the i variable calls this initializer behind the scenes.
ja: この例において、i定数への代入は、このイニシャライザを舞台裏で呼びます。

source: In this example, the assignment to the x constant calls this integer literal initializer behind the scenes.
ja: この例において、x定数への代入は、この整数リテラルイニシャライザを舞台裏で呼びます。

source: In this example, three elements in the middle of an array of integers are replaced by the five elements of a Repeated<Int> instance.
ja: この例では、整数からなる配列の真ん中の３つの要素が、Repeated<Int>インスタンスの５つの要素によって置き換えられます。

source: In this model, each state is represented by a case with a matching name.
ja: このモデルにおいて、各状態は合致する名前を持つケース節によって表されます。

source: In this model, the app defines two variables: an optional user that stores user information, and a Boolean value named sessionExpired.
ja: このモデルでは、アプリは２つの変数を定義します：ユーザ情報を格納するオプショナルのuser、そしてsessionExpiredと名前をつけられるブール値。

source: Indices and Iterators
ja: インデックスとイテレータ

source: Inequality is the inverse of equality.
ja: 不等性は、同等性の裏返しです。

source: Infrequently Used Functionality
ja: 滅多に使われない機能性

source: Inherited By
ja: 継承される先

source: Inherits From
ja: 継承元

source: Initialization with Literals
ja: リテラルを使った初期化

source: Initializer methods are imported by Swift with double underscores (__) prepended to their first argument labels.
ja: イニシャライザメソッドそれらは、Swiftによって、それらの最初の引数ラベルの前に付けられる二重アンダースコア（__）を使ってインポートされます。

source: Initializers
ja: イニシャライザ

source: Inpsecting Publisher Properties
ja: パブリッシャープロパティを検査する

source: Inserts a new element into the collection at the specified position.
ja: ある新しい要素をコレクションへ指定された位置で挿入します。

source: Inserts the elements of a sequence into the collection at the specified position.
ja: あるシーケンスに属する複数の要素をコレクションへ指定された位置で挿入します。

source: Inserts the elements of another set into this option set.
ja: 別のセットの要素をこのオブションセットへと挿入します。

source: Inserts the elements of the given sequence into the set.
ja: 与えられたシーケンスの要素を集合に挿入します。

source: Inserts the given element in the set if it is not already present.
ja: それが既に存在するのでないならば、与えられた要素を集合へと挿入します。

source: Inserts the given element into the set unconditionally.
ja: 与えられた要素を集合へと無条件に挿入します。

source: Inserts the given element into the set.
ja: 与えられた要素をセットへと挿入します。

source: Inspecting Publisher Properties
ja: パブリッシャープロパティを検査する

source: Inspecting a Buffer
ja: バッファを調査する

source: Inspecting a Range
ja: 範囲を調査する

source: Inspecting a Set
ja: 集合を調査する

source: Inspecting an Optional
ja: オプショナルを調査する

source: Instance Method
ja: インスタンスメソッド

source: Instance Methods
ja: インスタンスメソッド

source: Instance Properties
ja: 様々なインスタンスプロパティ

source: Instance Property
ja: インスタンスプロパティ

source: Instantiates an instance of the conforming type from a string representation.
ja: 準拠する型のインスタンスを文字列表現から初期化します。

source: Instead, convert an instance of any type to a string by using the String(describing:) initializer.
ja: 代わりに、どんな型のインスタンスでも文字列へと、String(describing:)イニシャライザを使って変換してください。

source: Instead, convert an instance of any type to a string by using the String(reflecting:) initializer.
ja: 代わりに、どんな型のインスタンスでも文字列へと、String(reflecting:)イニシャライザを使って変換してください。

source: Instead, create a new set using an array literal as its value by enclosing a comma-separated list of values in square brackets.
ja: 代わりに、新しい集合を配列リテラルをそれの値として、コンマ区切りの値のリストを角カッコで囲むことによって、作成してください。

source: Instead, initialize a variable or constant using an integer literal.
ja: 代わりに、整数リテラルを使って変数や定数を初期化してください。

source: Instead, use reduce for summing operations, or forEach or a for-in loop for operations with side effects.
ja: 代わりに、reduceを合計演算のために、またforEachやfor-inループを副作用付き演算のために、使ってください。

source: Instead, use the Result enumeration to capture information about whether an asychronous call succeeds or fails, and use the associated values for the Result.success(_:) and Result.failure(_:) cases to carry information about the result of the call.
ja: 代わりに、Result列挙を使うことで、非同期の呼び出しが成功するか失敗するかについての情報をキャプチャしてください、そしてResult.success(_:)とResult.failure(_:)ケース節に対する関連値を使うことで、呼び出しの結果についての情報を運んでください。

source: Instead, you can perform set operations with another set, an array, or any other sequence type.
ja: それどころか、あなたは集合演算を他の集合、配列、またはあらゆる他のシーケンス型とで実行できます。

source: Instead, you represent a value that could be missing as wrapped in an optional type.
ja: 代わりに、あなたは見つからないかもしれない値をオプショナル型でラップすることで表します。

source: Integer
ja: 整数

source: Interoperability makes it possible to integrate features migrated to Swift into Objective-C code with no hassle.
ja: 相互運用性は、Swiftに移される特徴を、面倒なしでObjective-Cコードに統合することを可能にします。

source: Invoke the throwing expression inside the closure you pass to the initializer:
ja: スロー式をあなたがこのイニシャライザに渡すクロージャ内から発動してください。

source: It is safe to use operations that put an upper limit on the number of elements they access, such as prefix(_:) or dropFirst(_:), and operations that you can guarantee will terminate, such as passing a closure you know will eventually return true to first(where:).
ja: 安全なのは、上側の限界をそれらがアクセスする要素数に置く演算、例えばprefix(_:)またはdropFirst(_:)など、そしてあなたが終わらせることができる演算、例えばあなたが結局はtrueをfirst(where:)に返すと知っているクロージャを渡すことなどの使用です。

source: It is used by the compiler when you initialize an Optional instance with a nil literal.
ja: それは、あなたがOptionalインスタンスをnilリテラルで初期化する時にコンパイラによって使われます。

source: It is used by the compiler when you use an array literal.
ja: それは、あなたが配列リテラルを使う時にコンパイラによって使われます。

source: It's also possible to model an app’s state by using individual variables in combination to hold the state and the required data, which is not recommended.
ja: アプリの持つ状態を、状態と必要データを保持するよう組み合わせた独立した幾つかの変数を使ってモデル化することもまた可能です、それは推奨されません。

source: Iterating Over a Range's Elements
ja: ある範囲の持つ要素すべてに反復していく

source: Iterating Over a Sequence's Elements
ja: あるシーケンスの要素のすべてに反復する

source: Iterating over a Set
ja: 集合のすべてに反復する

source: Its deinit must destroy its stored Header and any constructed Elements.
ja: それのdeinitは、それの格納されたHeaderとあらゆる構成されたElementを破棄しなければなりません。

source: Key Paths
ja: キーパス

source: Key-Path Expressions
ja: キーパス式

source: Key-Value Pairs as a Function Parameter
ja: 関数パラメータとしてのキー値ペア

source: KeyedDecodingContainerProtocol Implementations
ja: KeyedDecodingContainerプロトコルの実装

source: KeyedEncodingContainerProtocol Implementations
ja: KeyedEncodingContainerProtocol 実装

source: Language Interoperability
ja: 言語互換性

source: Lastly, use the eponymous replaceSubrange(_:with:) method to replace a subrange of elements with the contents of another collection.
ja: 最後に、名前の元となったreplaceSubrange(_:with:)メソッドを使って、いくつかの要素からなる下位範囲を別のコレクションの内容で置き換えてください。

source: Lazy Collections
ja: 遅延コレクション

source: Lazy Wrappers
ja: 遅延ラッパー

source: Lazy sequences can be used to avoid needless storage allocation and computation, because they use an underlying sequence for storage and compute their elements on demand.
ja: 遅延シーケンスは、不必要なストレージの割り当てと計算を防止するために使われることができます。

source: Learn how functions and methods that take a completion handler are converted to Swift asynchronous functions.
ja: 完了ハンドラをとる関数およびメソッドがどのようにSwift非同期関数へと変換されるかを学んでください。

source: Learn the recommended steps to migrate your code.
ja: あなたのコードを移行するための推奨される段階を学んでください。

source: Likewise, RangeReplaceableCollection types can remove one or more elements using a single operation.
ja: 同様に、RangeReplaceableCollection型は、１つ以上の要素の削除をただ１つの演算を使って行えます。

source: Likewise, if distance < 0, a limit that is greater than i has no effect.
ja: 同様に、distance < 0ならば、iより大きい限度は効果を持ちません。

source: Likewise, if distance < 0, limit should be less than i to have any effect.
ja: 同様に、distance < 0ならば、limitが何らかの効果を持つにはiより少なくなければなりません。

source: Likewise, if you pass a zero-length collection as the newElements parameter, this method removes the elements in the given subrange without replacement.
ja: 同様に、あなたがゼロ長コレクションをnewElementsパラメータとして渡すならば、このメソッドは与えられた下位範囲の中の要素を置き換えることなく削除します。

source: MLShapedArrayProtocol Implementations
ja: MLShapedArrayプロトコル実装

source: Maintaining State in Your Apps
ja: あなたのアプリの状態を保守する

source: Make an API Unavailable in Both Languages
ja: あるAPIを両方の言語で利用できなくする

source: Make sure that your Objective-C code and Swift code have optimal compatibility by tidying up and modernizing your existing Objective-C codebase.
ja: あなたのObjective-CコードとSwiftコードが最善の互換性を持つことを、あなたの既存のObjective-Cコード基盤を整頓および近代化することによって確かにしてください。

source: Make sure your code follows modern coding practices so that it interacts more effectively with Swift.
ja: あなたのコードが近代的コード慣行に従うことを確かにしてください、それでそれはより効果的にSwiftと相互作用します。

source: Making Objective-C APIs Unavailable in Swift
ja: Objective-C APIをSwiftにおいて利用できなくする

source: Making false assumptions about when a closure is called can lead to data inconsistency and app crashes.
ja: いつクロージャが呼び出されるかについてfalseを仮定することは、データの矛盾そしてアプリクラッシュに至る可能性があります。

source: Making your own custom types conform to Sequence enables many useful operations, like for-in looping and the contains method, without much effort.
ja: あなたのあつらえの型をSequenceに準拠させることは、多くの有用な演算能力を与えます、for-inループおよびcontainsメソッドのように、あまり苦労せずに。

source: Manage the given buffer.
ja: 指定されたbufferを管理します。

source: Managed Buffers
ja: バッファ管理

source: Manipulating Indices
ja: インデックスを操る

source: Manual Memory Management
ja: 手動メモリ管理

source: Many of the APIs you use in Swift take a closure—or a function passed as an instance—as a parameter.
ja: あなたがSwiftで使うAPIの多くは、クロージャ — またはインスタンスとして渡される関数 — をパラメータとして取ります。

source: Many sequence and collection operations return an array or a type-erasing collection wrapper instead of a set.
ja: 多くのシーケンスおよびコレクション演算は、集合ではなく、ある配列またはある型消去コレクションラッパーを返します。

source: Mark Availability
ja: 利用可能性を印する

source: Marking API Availability in Objective-C
ja: API利用可能性をObjective-Cにおいて印する

source: Marking the MyList declaration as audited for nullability reduces the number of annotations that are required.
ja: MyList宣言をヌル可能性について監査済みと印することは、必要とされる注釈の数を減らします。

source: Migrate Your Code
ja: あなたのコードを移行する

source: Migrating Your Objective-C Code to Swift
ja: あなたのObjective-Cコードのスウィフトへの移行
